andrew-2.3.1/run/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (-1.1 -1.1 -0.1)
    ( 1.1 -1.1 -0.1)
    ( 1.1  1.1 -0.1)
    (-1.1  1.1 -0.1)

    (-1.1 -1.1  2.1)
    ( 1.1 -1.1  2.1)
    ( 1.1  1.1  2.1)
    (-1.1  1.1  2.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (21 21 21)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);

// ************************************************************************* //
